<a href="https://colab.research.google.com/github/rafpank/Colab/blob/main/data_science_bootcamp%20/wprowadzenie/01_pandas_intro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas
Podstawowa biblioteka do analizy danych w języku Python

Strona biblioteki: https://pandas.pydata.org
Żeby zainstalowac bibliotekę:


`
pip install pandas
 `

In [1]:
import pandas as pd
pd.__version__

'2.2.2'

In [7]:
import numpy as np #biblioteka numpy jest nam potrzebna żeby uzupełnić braki danych

#Podstawowe struktury danych typu: Series

In [3]:
s = pd.Series(data=[3, 2, 4, 6])
s

0    3
1    2
2    4
3    6
dtype: int64

Warto zwrócić uwagę że oprócz samej serii danych pojawił nam się też index

In [4]:
s = pd.Series(data=[3,2,4,6], index=['a','b','c','d'])
s

a    3
b    2
c    4
d    6
dtype: int64

In [5]:
s = pd.Series(data=[3,2,4,6], index=['a','b','c','d'], name='sample')
s

a    3
b    2
c    4
d    6
Name: sample, dtype: int64

In [6]:
s = pd.Series(data=[3.,2,4,6], index=['a','b','c','d'], name='sample')
s

a    3.0
b    2.0
c    4.0
d    6.0
Name: sample, dtype: float64

In [8]:
np.nan #not a number - atrybut ten umożliwia nam wstawiać braki

nan

a poniżej przykład jak działa np.nan

In [9]:
s = pd.Series(data=[3., np.nan, 4, 6], index=['a','b','c','d'], name='sample')
s

a    3.0
b    NaN
c    4.0
d    6.0
Name: sample, dtype: float64

dzięki NaN, wartość ta nie wpłynie nam na średnią, a np cyfra 0 wpłynie

In [11]:
s = pd.Series(data=[True, False, False]) #typ bool
s

0     True
1    False
2    False
dtype: bool

In [13]:
s = pd.Series(data=np.arange(10,20)) #obiekt numpy wstawiający liczby od 10 do 19stu
s

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [15]:
s = pd.Series(data=np.arange(10, 20), index= pd.date_range(start='20200101', periods=10)) #index zastępujemy datami, określamy od kiedy i ile tych dat ma być
s

2020-01-01    10
2020-01-02    11
2020-01-03    12
2020-01-04    13
2020-01-05    14
2020-01-06    15
2020-01-07    16
2020-01-08    17
2020-01-09    18
2020-01-10    19
Freq: D, dtype: int64